# Запуск TelegramMaster 2.0

После установки Python и необходимых библиотек, вы можете запустить TelegramMaster 2.0 различными способами в зависимости от используемой операционной системы: Windows, Linux или MacOS.

<hr align="center"/>

## Windows

1. Запуск через файл Запуск.bat:
   - Найдите файл Запуск.bat в папке проекта и дважды щелкните по нему.
2. Запуск через main.py:
   - Найдите файл main.py в папке проекта и дважды щелкните по нему.
3. Запуск через консоль:
   - Откройте Terminal или командную строку в папке TelegramMaster 2.0 и введите команду:
   ```
   python main.py
   ```
<hr align="center"/>

## Linux

В разных дистрибутивах Linux используются разные командные интерпретаторы, такие как shell (Unix shell) и bash (Bourne again shell). Для запуска python-скриптов используйте следующие шаги:

1. Установка Python:
   - Убедитесь, что Python установлен (инструкция для Linux).
2. Открытие терминала:
   - Нажмите Ctrl+Alt+T или откройте "Приложения" → "Терминал" (для версий Linux с графическим интерфейсом).
3. Запуск скрипта:
   - Введите команду для запуска:
   ```
   python3 TelegramMaster/main.py
   ```
   - Пример:
   ```
   python3 /TelegramMaster/main.py
   ```
4. Для удобства: перейдите в каталог со скриптом и используйте только название файла:
    ```
    cd /TelegramMaster
    python3 main.py
    ```

☝️ **Примечание**: В большинстве дистрибутивов Linux команда python по умолчанию запускает Python 2.x.x. После установки Python 3 он будет доступен через команду python3.

<hr align="center"/>

## MacOS

В MacOS по умолчанию используется командный интерпретатор bash. Процесс запуска python-скриптов аналогичен Linux.

1. Установка Python:

   - Убедитесь, что Python установлен (инструкция для MacOS).
2. Открытие терминала:

   - Откройте "Программы" ("Launchpad") → "Утилиты" → "Терминал" или "Finder" → каталог "Программы/Утилиты" → "Терминал".
3. Запуск скрипта:

   - Введите команду:
   ```
   python3 /TelegramMaster/main.py
   ```
   - Пример:
   ```
   python3 /TelegramMaster/main.py
   ```