Telegram_SMM_BOT в будущем (TelegramMaster) работает на Python;

🐍 Python — самый популярный язык программирования, на котором разрабатывают ИИ, игры и сложные системы. Разбираемся с его установкой. Код программы открытый, так как это ваша безопасность, и вы знали, что нечего лишнего не зашито и не добавлено. Скачивать версию 🐍 Python в зависимости от вашей версии операционной системы: если это Windows, то для Windows; если это Linux, то для Linux; также и по аналогии с Mac OS. Для **Windows** 10, 11 – любая новая версия

**Для Windows 7 рекомендуется использовать Python версии 3.8.7.** В некоторых случаях может возникнуть проблема с установкой 🐍 Python из-за требования обновления Windows. В таком случае рекомендуется скачать версию **Python 3.6**, которая является минимальной версией для работы с программой. Если у вас возникли трудности, не стесняйтесь обратиться ко мне за помощью [https://t.me/PyAdminRU](https://vk.com/away.php?to=https%3A%2F%2Ft.me%2FPyAdminRU&cc_key=).

К сожалению, не все ОС содержат Python по умолчанию. Для загрузки 🐍 Python рекомендуется использовать исключительно официальный сайт, поскольку Python является бесплатным программным обеспечением, и платных версий не существует. [Ссылка](https://vk.com/away.php?to=https%3A%2F%2Fwww.python.org%2Fdownloads%2Fwindows%2F&cc_key=) предназначена специально для скачивания Python под операционную систему Windows.

![26.12.2023 Установка &#128013; Python (обновление pip), изображение №1](https://sun9-32.userapi.com/impg/EuoS3shUO3_BWb2MTndN4d1jI8W0CtPRnNcBEg/oRt8r5gpPLM.jpg?size=807x454&quality=95&sign=d5de8b4b29fca0850fc15d060c1fdb4c&type=album)

Следует отметить, что в Linux и Mac OS 🐍 Python часто устанавливается по умолчанию и может не требовать отдельной загрузки.

Как установить 🐍 Python на Windows, Linux и macOS

Перед установкой убедитесь, что ваш компьютер удовлетворяет системным требованиям:

- 64- или 32 - разрядный процессор на архитектуре Intel или AMD;

- 2 ГБ оперативной памяти, желательно 4 ГБ;

- 5 ГБ свободного места в памяти компьютера;

- версия операционной системы: не ниже Windows 7, macOS X 10.11, Red Hat Enterprise Linux 6/7.

Дистрибутивы Python есть для всех популярных операционных систем, они перечислены на [официальном сайте python.org](https://vk.com/away.php?to=https%3A%2F%2Fwww.python.org%2Fdownloads%2F%3Froistat_visit%3D12724225&cc_key= "https://www.python.org/downloads/?roistat_visit=12724225"). По большому счёту, не так важно, какую конкретно версию Python вы скачаете, — главное, чтобы её номер начинался с цифры 3.

## 🖱️Установка python на Windows

Скачайте установочный файл, нажав на жёлтую кнопку Download Python, и запустите его.

![26.12.2023 Установка &#128013; Python (обновление pip), изображение №2](https://sun9-53.userapi.com/impg/1X9GIlfElVojUIZsg4axy-UESjfE3ucfzZRaoQ/YI1M1i1fO44.jpg?size=807x454&quality=95&sign=8326d6b219a8d957b55142690d838bf7&type=album)

Выберите путь установки и поставьте обе галочки: во втором пункте мы указываем, что нужно добавить 🐍 Python в переменную окружения PATH — это позволит вызывать его из любой директории. Затем выбираем «Установка для всех пользователей» (Install for all users), нажимаем **Install Now** и разрешаем приложению вносить изменения:

> **И не забудьте поставить галочку на пункте Add Python 3.x to PATH.**

![26.12.2023 Установка &#128013; Python (обновление pip), изображение №3](https://sun9-21.userapi.com/impg/TvmVsUa66hZa4OymiXUW1V1ByUuF0o3vk8guKg/uCiiV4Y4jXs.jpg?size=807x496&quality=95&sign=3cc552885897f886bcc1da2d5341b85d&type=album)

> В 90% случаев, претензии о неработающей программе обусловлены тем, что пользователь не установил простую галочку. Важно заметить, что необходимо быть внимательным при установке и убедиться, что галочка установлена, прежде чем утверждать, что программа работает. Если у вас уже установлен Python, но что-то не функционирует, рекомендуется удалить его и провести повторную установку, обязательно установив необходимую галочку.

## ⚙️ Установка python на Linux

Python входит в состав большинства дистрибутивов ⚙️ Linux. Чтобы это проверить, введите в терминале следующую команду:

> **python3 --version**

В окне должен появиться номер версии языка. Если этого не произошло, нужно установить 🐍 Python с помощью пакетного менеджера.

В Ubuntu 16.10 это делается так:

> **sudo apt-get update**

> **sudo apt-get install python3.6**

Утилита попросит вас ввести пароль и после ввода начнёт установку.

_Однако, если вы хотите поставить более свежую версию 🐍 Python, для установки нужно использовать репозиторий deadsnakes PPA:_

> **sudo apt-get install software-properties-common**

> **sudo add-apt-repository ppa:deadsnakes/ppa**

> **sudo apt-get update**

> **sudo apt-get install python3.8**

В Fedora Linux процесс установки похожий, но используется другая команда:

> **sudo dnf install python3.9**

Важный момент: это установка системного пакета, поэтому её нужно запускать с правами администратора — то есть к команде установки добавить команду sudo.

## 🍏 Установка python на macOS

С давних времён MacBook и iMac выпускались с предустановленным 🐍 Python 2.7. Правда, начиная с версии 12.3 разработчики «яблочной 🍏» ОС отказались от этой традиции.

Чтобы проверить, установлен ли Python, откройте командную строку и введите следующую команду:

> **python --version**

![26.12.2023 Установка &#128013; Python (обновление pip), изображение №4](https://sun9-39.userapi.com/impg/ZB92pSuR-8J8dsCsQOO4421a45DuINRBDMIg3Q/-T3o1h6MdD8.jpg?size=728x410&quality=95&sign=eb85252bf43c16ebcd6b36366c1d9770&type=album)

В любом случае лучше установить последнюю версию 🐍 Python — найти её можно на [официальном сайте](https://vk.com/away.php?to=https%3A%2F%2Fwww.python.org%2Fdownloads%2F%3Froistat_visit%3D12724225&cc_key= "https://www.python.org/downloads/?roistat_visit=12724225").

Нажмите жёлтую кнопку **Download Python 3.11.2**, и пакет начнёт скачиваться:

![26.12.2023 Установка &#128013; Python (обновление pip), изображение №5](https://sun9-24.userapi.com/impg/7J6xrWqYuPHUW0D7FKDUFkKrCVEo_WNOsAe9Xw/R69UeXH8hRo.jpg?size=689x253&quality=95&sign=94deaad27c60f2e6188bff5e8b9ba130&type=album)

Когда загрузка завершится, откройте его:

![26.12.2023 Установка &#128013; Python (обновление pip), изображение №6](https://sun9-79.userapi.com/impg/sYmyPgmN0UnFwrgzJ1F13d4D3tnh0fmPEszlzw/-lDEWlt9eE8.jpg?size=662x467&quality=95&sign=9a80e0f337594ddadc73cd00dc3992cb&type=album)

Согласитесь, со всеми пунктами и переходите к установке. Вас попросят ввести пароль, а после — начнётся установка, по окончании которой вы увидите такое окно:

![26.12.2023 Установка &#128013; Python (обновление pip), изображение №7](https://sun9-44.userapi.com/impg/aDG4BBIYjjIvdfwcnP_Klszh2aMUEDoJV7igxg/qqN_CAAb_2Q.jpg?size=695x497&quality=95&sign=009e633453a55b2f0b2eee168ad5a2bd&type=album)

Нажмите **Close** и откройте терминал, чтобы проверить версию 🐍 Python:

> **python –version**

## Обновление pip на Windows, ⚙️ Linux, macOS

Если вы используете операционную систему Windows и установили Python с вашего архива, важно регулярно обновлять инструменты, такие как pip, для обеспечения безопасности и совместимости с последними версиями библиотек. Для этого выполните следующие шаги:

1️⃣ Нажмите "Пуск" на экране вашего компьютера.

2️⃣ В строке поиска начните вводить "командная строка" или "cmd".

3️⃣ В поисковой выдаче выберите "Командная строка" или "cmd", затем откройте ее, предпочтительно, щелкнув правой кнопкой мыши и выбрав "Запуск от имени Администратора" для установки привилегий администратора.

После открытия командной строки выполните следующую команду:

> **python -m pip install --upgrade pip**

Нажмите Enter, чтобы запустить команду. Это обновит pip до последней версии. Убедитесь, что у вас есть подключение к Интернету, так как обновление pip может потребовать загрузки данных из сети.

## На ⚙️ Linux, macOS откройте терминал и введите команду

> **python3 -m pip install --upgrade pip**

Обновление pip обеспечит корректную работу менеджера пакетов 🐍 Python и поможет избежать проблем с установкой и обновлением библиотек.

**Pip** — система управления пакетами, которая используется для установки и управления программными пакетами, написанными на 🐍 Python.