# Парсинг меню

parse_single_or_multiple_groups: str = "🔍 Парсинг одной группы / групп"
parse_selected_user_subscribed_group: str = "📂 Парсинг выбранной группы из подписанных пользователем"
parse_active_group_members: str = "👥 Парсинг активных участников группы"
parse_account_subscribed_groups_channels: str = "📜 Парсинг групп / каналов на которые подписан аккаунт"
clear_previously_parsed_data_list: str = "🗑️ Очистка списка от ранее спарсенных данных"

# Инвайтинг меню
inviting: str = "🚀 Инвайтинг"
invitation_1_time_per_hour: str = "⏰ Инвайтинг 1 раз в час"
invitation_at_a_certain_time: str = "🕒 Инвайтинг в определенное время"
inviting_every_day: str = "📅 Инвайтинг каждый день"
